/*
주석문 (Comment)
	• 주석문은 실제 프로그램에 영향을 주지 않으며
	• 단지 소스코드의 기능이나 동작을 설명하기 위해 사용되어 집니다. 
	• 코드에 대한 부가 설명 제공(프로그램 문서화의 중요한 부분)
	• 주석(Comment)은 메모 기능을 가며 컴파일시 컴파일러에 의해 해당 내용은 무시됩니다.
	• 같은 주석은 중복 사용시 컴파일 에러 발생 


주석문의 종류
단행 주석 		
• 행단위 주석
• 현재 형에서 // 뒤의 한 문장 전체를 주석으로 처리

다행 주석
• 열린 주석과  닫힌 주석사이의 여러 문장을 주석으로 처리
• 주로 개발자들이 소스에 기록을 남기나 참고하기 위하여 작성
*/


public class Basic {
	public static void main(String[] args){
		
		
		//한줄 주석
		//System.out.println("한줄 주석 달기");
		
		
		/*여러줄 주석
		
		파일이름: Basic.java
		작성자: CodeDragon
		강의내용: 주석문 확인
		System.out.println("다행 주석 달기");
		
		*/
		 		 
		System.out.println("주석 달기");
		
	}
}
